paulusTecnion/uberlogger-stm32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "esp32_interface.h"
#include "stdint.h"
#include "string.h"
#include <time.h>
#include "spi_ctrl.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */


// WARNING: DO NOT CHANGE THE NEXT LINES UNLESS YOU KNOW WHAT YOU ARE DOING.
// BYTES NEED TO BE 4 BYTES ALIGNED!
#define DATA_LINES_PER_SPI_TRANSACTION  70
#define ADC_VALUES_PER_SPI_TRANSACTION  DATA_LINES_PER_SPI_TRANSACTION*8 // Number of ADC uint16_t per transaction. This is 5 times 480 ADC values
#define ADC_BYTES_PER_SPI_TRANSACTION ADC_VALUES_PER_SPI_TRANSACTION*2
#define GPIO_BYTES_PER_SPI_TRANSACTION  DATA_LINES_PER_SPI_TRANSACTION*1
#define TIME_BYTES_PER_SPI_TRANSACTION  DATA_LINES_PER_SPI_TRANSACTION*12
#define START_STOP_NUM_BYTES            2


// Number of bytes when receiving data from the STM
#define STM_SPI_BUFFERSIZE_DATA_TX      (ADC_BYTES_PER_SPI_TRANSACTION + GPIO_BYTES_PER_SPI_TRANSACTION + TIME_BYTES_PER_SPI_TRANSACTION + START_STOP_NUM_BYTES)
#define STM_DATA_BUFFER_SIZE_PER_TRANSACTION (ADC_BYTES_PER_SPI_TRANSACTION + GPIO_BYTES_PER_SPI_TRANSACTION + TIME_BYTES_PER_SPI_TRANSACTION)

//#define STM_SPI_BUFFERSIZE_DATA_TX 1020
#define ADC_BUFFERSIZE_SAMPLES ADC_VALUES_PER_SPI_TRANSACTION*2
#define ADC_BUFFERSIZE_BYTES ADC_BUFFERSIZE_SAMPLES*2
#define GPIO_IO_BUFFERIZE_BYTES GPIO_BYTES_PER_SPI_TRANSACTION*2
#define TIME_BUFFERSIZE_BYTES TIME_BYTES_PER_SPI_TRANSACTION*2


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_tx;
DMA_HandleTypeDef hdma_spi1_rx;

TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim14;

/* USER CODE BEGIN PV */
TIM_HandleTypeDef htim3_bak;
uint8_t MainState = MAIN_IDLE, NextState = MAIN_IDLE;
uint8_t logging_en = 0;
uint8_t msgRx = 0;
uint8_t cmd_buffer[ 20];
//spi_cmd_t cmd_buffer;

ADC_HandleTypeDef hadc1_bak;

uint8_t main_exit_config = 0;

volatile uint16_t data_buffer_write_ptr = 0;
volatile uint32_t gpio_result_write_ptr = 0;
volatile uint32_t time_result_write_ptr = 0;

static uint8_t adc_is_half = 0;

static RTC_TimeTypeDef current_time;
static RTC_DateTypeDef current_date;

// Variable for retrieving the
s_date_time_t current_date_time;

uint16_t tim3_counter = 0;
uint8_t tim14_event = 0;

typedef struct {
    uint8_t startByte[START_STOP_NUM_BYTES];
    uint16_t dataLen;
    s_date_time_t timeData[DATA_LINES_PER_SPI_TRANSACTION];
    uint8_t padding3;
    uint8_t padding4;
    uint8_t gpioData[GPIO_BYTES_PER_SPI_TRANSACTION];
    uint8_t adcData[ADC_BYTES_PER_SPI_TRANSACTION];
} spi_msg_1_t;

typedef struct {
    uint8_t adcData[ADC_BYTES_PER_SPI_TRANSACTION];
    uint8_t gpioData[GPIO_BYTES_PER_SPI_TRANSACTION];
    uint8_t padding1;
    uint8_t padding2;
    s_date_time_t timeData[DATA_LINES_PER_SPI_TRANSACTION];
    uint16_t dataLen;
    uint8_t stopByte[START_STOP_NUM_BYTES];
} spi_msg_2_t;



uint8_t data_buffer[sizeof(spi_msg_1_t) + sizeof(spi_msg_2_t)];
uint8_t rxbuffer[20];
spi_msg_1_t * spi_msg_1_ptr = (spi_msg_1_t*) data_buffer;
spi_msg_2_t * spi_msg_2_ptr = (spi_msg_2_t*) (data_buffer + sizeof(spi_msg_1_t)) ;

log_mode_t logMode = LOGMODE_CSV;
uint8_t _data_lines_per_transaction = DATA_LINES_PER_SPI_TRANSACTION;

extern uint8_t spi_ctrl_state;
uint8_t overrun = 0, adc_ready = 0;
uint8_t datardypin;



/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_SPI1_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM3_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM14_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

// From https://github.com/LonelyWolf/stm32/blob/master/stm32l-dosfs/RTC.c
// Convert epoch time to Date/Time structures



void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{

	if (htim == &htim14)
	{
		// Disable interrupt
		TIM14->DIER &= ~TIM_DIER_UIE;
//		CLEAR_BIT(TIM14->DIER, TIM_DIER_UIE);
		TIM14->CNT = 0;
		// Indicate timeout
		SET_BIT(spi_ctrl_state, SPI_CTRL_TIMEOUT);
	}

	if (htim == &htim3 )
	  {
		if (adc_ready)
		{
			gpio_result_write_ptr = 0;
			time_result_write_ptr = 0;
			// Half way we have the pointers start at the beginning
			if (READ_BIT(spi_ctrl_state,SPI_CTRL_SENDING))
			{
				overrun = 1;
				return;
			}

			tim3_counter=0;

			if (adc_is_half)
			{
				spi_ctrl_send((uint8_t*)spi_msg_1_ptr, sizeof(spi_msg_1_t));
			} else {
				spi_ctrl_send((uint8_t*)spi_msg_2_ptr, sizeof(spi_msg_2_t));
			}
			adc_ready = 0;
		}

