paulusTecnion/uberlogger-stm32/Core/Src/main.c
		tim3_counter++;

		 // Check which version of the timer triggered this callback and toggle LED
		// Should be RTC_FORMAT_BCD, but there's a bug in the HAL_RTC_Gettime function
		HAL_RTC_GetTime(&hrtc, &current_time, RTC_FORMAT_BIN);
		HAL_RTC_GetDate(&hrtc, &current_date, RTC_FORMAT_BIN);


		current_date_time.year = current_date.Year;
		current_date_time.month = current_date.Month;
		current_date_time.date = current_date.Date;
		current_date_time.hours = current_time.Hours;
		current_date_time.minutes = current_time.Minutes;
		current_date_time.seconds = current_time.Seconds;
		// Next line not 100% correct!
		current_date_time.subseconds = 1000 * (current_time.SecondFraction - current_time.SubSeconds) / (current_time.SecondFraction + 1);

		// Are still in the first ADC half?
		if (!adc_is_half && (tim3_counter <= DATA_LINES_PER_SPI_TRANSACTION))
		{
			// 0x50000411 = GPIOB, 2nd byte (GPIOB8 to GPIOB15)
			spi_msg_1_ptr->gpioData[gpio_result_write_ptr] = (GPIOB->IDR >> 8);
			memcpy((void*)&spi_msg_1_ptr->timeData[gpio_result_write_ptr], &current_date_time, sizeof(s_date_time_t));
			spi_msg_1_ptr->dataLen = tim3_counter;
		} else { // If not, we fill the second part
			spi_msg_2_ptr->gpioData[gpio_result_write_ptr] = (GPIOB->IDR >> 8);
			memcpy((void*)&spi_msg_2_ptr->timeData[gpio_result_write_ptr], &current_date_time, sizeof(s_date_time_t));
			spi_msg_2_ptr->dataLen = tim3_counter;
		}
//
		gpio_result_write_ptr++;
//		time_result_write_ptr = time_result_write_ptr + sizeof(current_date_time);
//e
//		// to add: check for overrun
		if (gpio_result_write_ptr == GPIO_BYTES_PER_SPI_TRANSACTION)
		{
			gpio_result_write_ptr = GPIO_BYTES_PER_SPI_TRANSACTION-1;
		}
//
//		if (time_result_write_ptr <= TIME_BYTES_PER_SPI_TRANSACTION)
//		{
//			time_result_write_ptr = TIME_BYTES_PER_SPI_TRANSACTION-1;
//		}

	  }
}




void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* hadc)
{
		adc_is_half = 1;
		adc_ready = 1;
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc)
{
		adc_is_half = 0;
		adc_ready = 1;
}

void HAL_ADC_ErrorCallback(ADC_HandleTypeDef *hadc)
{

}

void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin)
{
	if (GPIO_Pin == STM_ADC_EN_Pin)
	{
			logging_en = 1;
	}
}

void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin)
{
	if (GPIO_Pin == STM_ADC_EN_Pin)
	{
		//HAL_SPI_DMAStop(&hspi1);

		logging_en = 0;

	}
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  PWR->CR1 |= PWR_CR1_DBP; // disable write protect
  RCC->BDCR |= 0x18; // Max drive strenght for LSE
  PWR->CR1 &= ~PWR_CR1_DBP; // enable write protect
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI1_Init();
  MX_ADC1_Init();
  MX_TIM3_Init();
  MX_RTC_Init();
  MX_TIM14_Init();
  /* USER CODE BEGIN 2 */

  // Set MISO pin drive strenght to High speed (bit 8 and 9 = '10' (bit 9 = 1))
  GPIOB->OSPEEDR |= (0x0200);

  // Enable TIM1 interrupt
//  TIM1->DIER |= TIM_DIER_UIE;
//  NVIC_EnableIRQ(TIM1_BRK_UP_TRG_COM_IRQn);

  HAL_ADCEx_Calibration_Start(&hadc1);
  // Backup current adc settings
  hadc1_bak = hadc1;

  spi_msg_1_ptr->startByte[0] = 0xFA;
  spi_msg_1_ptr->startByte[1] = 0xFB;
  spi_msg_2_ptr->stopByte[0]= 0xFB;
  spi_msg_2_ptr->stopByte[1]= 0xFA;

  HAL_TIM_Base_Start(&htim14);
  // Turn off the interrupt flag for timer 14.
  TIM14->DIER &= ~TIM_DIER_UIE;

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
	  spi_ctrl_loop();
//	  Config_Handler();
	  datardypin = HAL_GPIO_ReadPin(STM_DATA_RDY_GPIO_Port, STM_DATA_RDY_Pin);

	  switch(MainState)
	  {
	  	  case MAIN_LOGGING:
			  // Doing nothing
			  if (!logging_en || overrun)
			  {
				  if (overrun)
				  {
					  HAL_GPIO_WritePin(DATA_OVERRUN_GPIO_Port , DATA_OVERRUN_Pin, SET);
				  }
				  overrun =0;
				  // reset the this variable to 0, since we expect that a "

				  HAL_TIM_Base_Stop_IT(&htim3);
				  HAL_ADC_Stop_DMA(&hadc1);

				  // Delay of 50 ms, since signal ringing may cause a retrigger of LOGGING state
				  HAL_Delay(50);
				  // Set ADC to single conversion measure mode
				  NextState = MAIN_IDLE;
			  }
			  break;

		  case MAIN_IDLE:
			  if (logging_en && spi_ctrl_isIdle())
			  {
				  tim3_counter = 0;
				  adc_is_half = 0;
				  adc_ready = 0;
				  gpio_result_write_ptr = 0;
				  time_result_write_ptr = 0;

				  HAL_GPIO_WritePin(DATA_OVERRUN_GPIO_Port , DATA_OVERRUN_Pin, RESET);
				  // Make sure we have the original ADC config put in place
//				  hadc1 = hadc1_bak;
				  // Disable ADC
				  HAL_ADC_DeInit(&hadc1);
				  // Reinit ADC
//				  MX_ADC1_Init();
				  ADC_Reinit();

				  // Start TIM3 and DMA conversion
				  TIM3->CNT = 0;

				  HAL_ADC_Start_DMA(
						  &hadc1,
						  (uint32_t*)(spi_msg_1_ptr->adcData),
						  ADC_BUFFERSIZE_SAMPLES);
				  HAL_TIM_Base_Start_IT(&htim3);

				  NextState = MAIN_LOGGING;
			  } else  {
				  // Check for events

				  if (spi_ctrl_msg_received())
				  {
					spi_cmd_t * cmd = (spi_cmd_t*)&cmd_buffer;
					spi_cmd_t resp;
					  switch(cmd->command)
					  {

						  case STM32_CMD_SETTINGS_MODE:
							  resp.command = STM32_CMD_SETTINGS_MODE;
							  resp.data = CMD_RESP_OK;
					//			  if (HAL_SPI_Send_cmd(STM32_CMD_SETTINGS_MODE, CMD_RESP_OK) == HAL_OK)
							  if (spi_ctrl_send((uint8_t*)&resp, sizeof(spi_cmd_t)) == HAL_OK)
							  {
								  NextState = MAIN_CONFIG;
							  }

						  break;

						  case STM32_CMD_SINGLE_SHOT_MEASUREMENT:

							  resp.command = STM32_CMD_SINGLE_SHOT_MEASUREMENT;
							  resp.data = CMD_RESP_OK;
					//			  if (HAL_SPI_Send_cmd(STM32_CMD_SINGLE_SHOT_MEASUREMENT, CMD_RESP_OK) == HAL_OK)
							  if (spi_ctrl_send((uint8_t*)&resp, sizeof(spi_cmd_t)) == HAL_OK)
							  {
								  NextState = MAIN_SINGLE_SHOT;
							  }
							  break;

						  case STM32_CMD_SEND_LAST_ADC_BYTES:
							  if (adc_is_half)
							  {
								  // adc_is_half == 1 means the last message sent was spi_msg_1
								  // So we are now still writing in spi_msg_2.
								  spi_ctrl_send((uint8_t*)spi_msg_2_ptr, sizeof(spi_msg_2_t));
							  } else {
								  spi_ctrl_send((uint8_t*)spi_msg_1_ptr, sizeof(spi_msg_1_t));
							  }

							  break;

						  case CMD_NOP:
					//			  HAL_SPI_Send_cmd(CMD_RESP_OK, CMD_NOP);
//							  resp.command = CMD_NOP;
//							  resp.data = CMD_RESP_OK;
//							  spi_ctrl_send((uint8_t*)&resp, sizeof(spi_cmd_t));
							  break;

						  default:
					//			  HAL_SPI_Send_cmd(CMD_RESP_NOK, CMD_UNKNOWN);
							  resp.command = CMD_NOP;
							  resp.data = CMD_RESP_NOK;
							  spi_ctrl_send((uint8_t*)&resp, sizeof(spi_cmd_t));

